import styles from './index.module.scss';

function TermsContent() {
  return (
    <>
      <div className={styles.content}>
        <section className={styles.container}>
          <div>
            <h1>利用規約</h1>
            <hr />
            <p>Coin Look利用規約（以下「本規約」といいます。）は、本サイトにおいて提供するサービスをご利用いただくユーザー様（以下「ユーザー」といいます。）の遵守事項及び本サービスに関する本サイトの運営者（以下「運営者」といいます。）とユーザーとの間の関係が定められています。本サービスのご利用にあたっては､本規約への同意が必要となりますので、事前に本規約をご承諾の上､遵守事項を守りご利用願います｡</p>
            <hr />

            <h2>第1条（総則）</h2>
            <ol>
              <li>本規約は、本サービスに関するユーザーの遵守事項及び本サービスに関する運営者とユーザーとの間の関係等、本サービスの利用について基本的な事項を規定するものです。</li>
              <li>本サービスは、個人の私的利用に限るものとします。</li>
            </ol>
            <hr />

            <h2>第2条（本サービスについて）</h2>
            <ol>
              <li>本サービスは、投資に関するアドバイス又は仮想通貨売買の勧誘を目的としたものではありません。本サービスの利用による投資判断の結果等、本サービスの利用結果によりユーザーに生じた損害については、すべてユーザー自身が責任を負うものとし、運営者は一切の責任を負いません。本サービスの利用に関して、ユーザーが、運営者又は第三者に損害を与え、ユーザーに対し何らかの請求がされ、又は訴訟等が提起された場合には、ユーザーが自己の費用と責任で解決するものとします。</li>
              <li>ユーザーは、本規約の内容に同意したうえで、本サービスの利用を開始し、本サービスを利用するものとします。</li>
            </ol>
            <hr />

            <h2>第3条（禁止事項・利用停止等）</h2>
            <ol>
              <li>ユーザーは、本サービスの利用にあたり、以下の各号のいずれかに該当し又は各号のいずれかに該当する行為をしてはなりません。以下の各号のいずれかの事由に該当し又は各号のいずれかに該当する行為を行った場合は、運営者は、ユーザーに事前に通知することなく、当該ユーザーについて本サービスの利用を一時的に停止し、又は利用を取り消すことができるものとします。</li>
              <div>
                <p>(1) 運営者、他のユーザーその他の第三者に損害を生じさせるおそれのある目的若しくは方法で本サービスを利用した、又は利用しようとする行為。</p>
                <p>(2) 本サービス内で提供される情報等（以下「コンテンツ」といいます。）を著作権法で認められた私的利用の範囲を超えて、複製、出版、公表、譲渡、公衆送信、改変その他の態様で利用する行為、また、これらを行ったコンテンツを第三者へ提供する行為。</p>
                <p>(3) 運営者又は本サービスの他の利用者その他の第三者の知的財産権、肖像権、プライバシーの権利、名誉、その他の権利又は利益を侵害する行為（かかる侵害を直接又は間接に惹起する行為を含みます。）。</p>
                <p>(4) 本サービスを不正な目的で利用し、又はそれを第三者へ伝達する行為。</p>
                <p>(5) 本サービスのサーバーに不当な負担をかける行為や本サービスの運営を妨げる行為。</p>
                <p>(6) 法律、政令、法令、規則、命令、通達、条例、ガイドラインその他の規制（以下「法令等」といいます。）、本規約又は関連する規則に違反する行為。</p>
                <p>(7) コンピューター・ウィルスその他の有害なコンピューター・プログラムを含む情報を送信する行為。</p>
                <p>(8) その他運営者が不適当と判断する行為。</p>
              </div>
              <li>本条に基づき運営者が行った行為によりユーザーに生じた損害について、運営者は一切の責任を負いません。</li>
            </ol>
            <hr />

            <h2>第4条（著作権等の帰属）</h2>
            <p>本サービスに関する著作権その他一切の知的財産権は運営者に帰属し、ユーザーは、運営者の許諾を得ずにコンテンツを第三者に使用させ、又は公開することはできません。</p>

            <h2>第5条（本サービスの変更、中断、中止及び終了等）</h2>
            <ol>
              <li>運営者は、ユーザーに事前の通知をすることなく、本サイト若しくは本サービスの内容を変更し、又はコンテンツを削除することがあります。</li>
              <li>運営者は、以下各号の事由が生じた場合には、ユーザーに事前の通知をすることなく、本サービスの提供を一時的に中断することができます。</li>
              <div>
                <p>(1) 本サービス用のハード・ソフト・通信機器設備等に関わるメンテナンスや修理を行う場合。</p>
                <p>(2) 火災、停電、その他の不慮の事故、又は天災等の不可抗力により本サービスの提供が困難な場合。</p>
                <p>(3) その他前各号に準じ運営者が必要と判断した場合。</p>
              </div>
              <li>運営者は、ユーザーに事前に通知した上で、本サービスの提供を中止又は終了することができます。但し、緊急の場合はユーザーへの通知を行わない場合があります。</li>
              <li>運営者は、本サービスの利用希望者、ユーザー又は第三者に対して、本条第1項乃至第3項に定める変更、削除、中断、中止、又は終了等による損害賠償責任その他の一切の責任を負いません。</li>
            </ol>

            <h2>第6条（免責）</h2>
            <ol>
              <li>運営者は、仮想通貨の売買並びに仮想通貨の価値、機能、使用先及び用途につきいかなる保証及びいかなる責任（瑕疵担保責任を含みます。）も負うものではありません。また、ユーザーが運営者から直接又は間接に本サービス又は他のユーザーに関する情報を得た場合であっても、運営者はユーザーに対し本規約において規定されている内容を超えていかなる保証も行うものではありません。</li>
              <li>運営者は、仮想通貨に関する情報を提供するサービスを行うものであって、仮想通貨の売買の勧誘はもとより、有価証券の売買の勧誘や投資助言業務を目的としたものではありません。</li>
              <li>ユーザーは、本サービスを利用することが、ユーザーに適用のある法令等又は業界団体の内部規則等に違反するか否かを自己の責任と費用に基づいて調査するものとし、運営者は、ユーザーによる本サービスの利用が、ユーザーに適用のある法令等又は業界団体の内部規則等に適合することを何ら保証するものではありません。</li>
              <li>本サービス又は本サイトに関連してユーザーと他のユーザー又は第三者との間において生じた取引、連絡、紛争等については、ユーザーの責任において処理及び解決するものとし、運営者はかかる事項について一切の責任を負いません。</li>
              <li>運営者は、運営者による本サービスの提供の中断、停止、終了、利用不能又は変更、本サービスの利用によるデータの消失又は機器の故障若しくは損傷、その他本サービスに関連してユーザーが被った損害につき、賠償する責任を一切負わないものとします。</li>
              <li>本サイトから他のウェブサイトへのリンク又は他のウェブサイトから本サイトへのリンクが提供されている場合でも、運営者は、本サイト以外のウェブサイト及びそこから得られる情報に関していかなる理由に基づいても一切の責任を負いません。</li>
              <li>運営者は、仮想通貨に関する法令若しくは関連した消費税を含む税制の将来の制定又は変更によりユーザーが被った損害につき、賠償する責任を一切負わないものとします。</li>
              <li>運営者は、仮想通貨に対する法令等又は関連した消費税を含む税制の将来の制定又は変更の効力が過去に遡及したことによりユーザーが被った損害につき、過去に遡って賠償する責任を一切負わないものとします。</li>
              <li>運営者は、仮想通貨自体の価値、安定性及び適法性について、一切保証するものではありません。運営者は、ユーザーによる、仮想通貨の性質、メカニズム及びマーケット運営等の理解不足から発生するいかなる損害についても一切の責任を負いません。</li>
              <li>運営者は、コンテンツの完全性、真実性、正確性等に一切の責任を負いません。</li>
            </ol>

            <h2>第7条（本規約の改訂）</h2>
            <p>運営者は、運営者が必要と判断した場合、本規約を改訂することができます。運営者は本規約の改定を行うことができるものとし、いかなる改訂も適用可能になるものとします。また、ユーザーが本サービスを利用する場合、運営者は、ユーザーが変更後の本規約に同意したものとみなします。</p>
            
            <h2>第8条（準拠法）</h2>
            <p>本規約は、日本法に準拠し、解釈されるものとします。</p>

            <h2>第9条（協議）</h2>
            <p>本規約の規定に関する疑義又は本規約に定めのない事項については、運営者とユーザーが誠意をもって協議の上、解決するものとします。</p>
          </div>
        </section>

        <p>2021年11月1日　制定</p>
      </div>
    </>
  );
}

export default TermsContent;